app/controllers/planes_controller.rb

  def index
    @planes = Plane.all
---
SELECT "planes".* FROM "planes"

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]