app/controllers/session_controller.rb

  def create
    @user = User.find_by :name => params[:name]
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Austin"], ["LIMIT", 1]]