app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nash"], ["created_at", "2018-04-17 11:43:13.370971"], ["updated_at", "2018-04-17 11:43:13.370971"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save